# parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [9,17, 18,39, 37,67]       # P3/8
  - [62,132, 120,242, 273,363] # P4/16

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],    # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
   [-1, 1, SPP, [512, [5, 9, 13]]],
   [-1, 3, C3, [512, False]],  # 7-CSP
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [256, 1, 1]], # 8
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # 10: cat backbone P3
   [-1, 3, C3, [256, False]],  # 11: (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]], # 12
   [[-1, 8], 1, Concat, [1]],  # 13: cat head P4
   [-1, 3, C3, [512, False]],  # 14: (P4/16-mediaum)

   [[11, 14], 1, Detect, [nc, anchors]], # Detect(P3, P4)
  ]
